"""
Взявщи за основу код домашнього завдання лекції 14, розробіть набір тестів з використанням бібліотеки pytest
для методів додавання елементів, пошуку мінімального і максимального значень та видалення елементів бінарного дерева
"""
from tree_15_2 import *

def main():

    test_min_nod()
    test_max_nod()
    test_del_nod()

def test_min_nod():
    assert t.min_nod() == 2

def test_max_nod():
    assert t.max_nod() == 25

def test_del_nod():
    t.del_node(16)
    n, n_l, n_r = t.findval(20) # Метод findval був перероблений і вертає нод, що перевіряється на наявність та обидва дочірні ноди
    assert n_l == 13            # у даному випадку, видаляємий нод 16 заміщується нодом 20, та отримує лівий дочірній нод 13
    assert n_r == 25



if __name__ == "__main__":
    main()