"""
Умова:

1. Створіть Xls - документ, що містить дані про марки автомобілів, їхню вартість, споживання палива,
   максимальну швидкість та вантажопідйомність. Кількість записів у документі -20.
2. Візуалізуйте залежності: споживання палива від вартості - лінійною діаграмою;
   споживання палива від швидкості - точковим графіком; вантажопідйомності від швидкості - точковим графіком.
3. Побудуйте гістограму для розділення автомобілів на 5 груп за швидкістю.
4. Побудуйте коробковий графік для відображення швидкостей різних марок.
5. Побудуйте парний графік для відображення залежностей величин.
"""




import pandas as pd

columns = ["mark", "price", "fuel consumption", "max speed", "payload"]
toyota_motors = [["Yaris", 15600, 3.5, 160, 510],
                 ["Yaris Cross",  23514 , 5.9, 170, 540],
                 ["Corola", 21150, 6, 180, 470],
                 ["Corola Cross", 24395, 6.8, 510],
                 ["Camry", 25945, 7.8, 180, 530],
                 ["C-HR", 23880, 6.4, 170, 465],
                 ["RAV4", 27575, 6.7, 190, 600],
                 ["Hihlander", 36420, 6.7, 180, 680],
                 ["Land Cruiser Prado", 60830, 10.5, 180, 705],
                 ["Land Cruiser", 85665, 16.8, 175, 750],
                 ["Hilux", 59300, 9.7,  195, 470],
                 ["Proace City", 24085, 5.3, 150, 700],
                 ["Proace City Verso", 39895, 4.4, 170, 700],
                 ["Proace", 27700, 5.3, 183, 1200],
                 ["Proace Verso", 63840, 5.0, 200, 1200],
                 ["Sequoia", 58300, 15.0, 115, 1300],
                 ["Tundra", 37865, 12.4, 170, 880],
                 ["GR Supra", 43540, 10.3, 250, 313],
                 ["GR86", 28400, 8.0, 226, 402],
                 ["Century", 180000, 20, 239, 720]]

df = pd.DataFrame(toyota_motors, columns=columns)
print(df)